import { ReactElement } from "react";

export const afterPrayAzkar: { name: ReactElement, count: string }[] = [
    {
        name: <div> 
            أَسْـتَغْفِرُ الله، أَسْـتَغْفِرُ الله، أَسْـتَغْفِرُ الله.
            اللّهُـمَّ أَنْـتَ السَّلامُ ، وَمِـنْكَ السَّلام ، تَبارَكْتَ يا ذا الجَـلالِ وَالإِكْـرام
        </div>,
        count: "مرة واحدة",
    },
    {
        name: <div> 
            لا إلهَ إلاّ اللّهُ وحدَهُ لا شريكَ لهُ، لهُ المُـلْكُ ولهُ الحَمْد، وهوَ على كلّ شَيءٍ قَدير، اللّهُـمَّ لا مانِعَ لِما أَعْطَـيْت، وَلا مُعْطِـيَ لِما مَنَـعْت، وَلا يَنْفَـعُ ذا الجَـدِّ مِنْـكَ الجَـد
            </div>,
        count: "3 مرات",
    },
    {
        name: <div> 
            لا إلهَ إلاّ اللّه, وحدَهُ لا شريكَ لهُ، لهُ الملكُ ولهُ الحَمد، وهوَ على كلّ شيءٍ قدير، لا حَـوْلَ وَلا قـوَّةَ إِلاّ بِاللهِ، لا إلهَ إلاّ اللّـه، وَلا نَعْـبُـدُ إِلاّ إيّـاه, لَهُ النِّعْـمَةُ وَلَهُ الفَضْل وَلَهُ الثَّـناءُ الحَـسَن، لا إلهَ إلاّ اللّهُ مخْلِصـينَ لَـهُ الدِّينَ وَلَوْ كَـرِهَ الكـافِرون
            </div>,
        count: "مرة واحدة",
    },
    {
        name: <div> 
            سُـبْحانَ اللهِ، والحَمْـدُ لله ، واللهُ أكْـبَر
            </div>,
        count: "33 مرة",
    },
    {
        name: <div> 
            لا إلهَ إلاّ اللّهُ وَحْـدَهُ لا شريكَ لهُ، لهُ الملكُ ولهُ الحَمْد، وهُوَ على كُلّ شَيءٍ قَـدير
            </div>,
        count: "مرة واحدة",
    },
    {
        name: <div> 
                بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم<br />
قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ<br />
بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم<br />
قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ<br />
بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم <br />
قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ<br />
(ثلاث مرات بعد صلاتي الفجر والمغرب. ومرة بعد الصلوات الأخرى)
            </div>,
        count: "3 مرات",
    },
    {
        name: <div> 
            أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ<br />
            اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ [آية الكرسى - البقرة 255]
            </div>,
        count: "مرة واحدة",
    },
    {
        name: <div> 
                لا إلهَ إلاّ اللّهُ وحْـدَهُ لا شريكَ لهُ، لهُ المُلكُ ولهُ الحَمْد، يُحيـي وَيُمـيتُ وهُوَ على كُلّ شيءٍ قدير
                <br />
                (عَشْر مَرّات بَعْدَ المَغْرِب وَالصّـبْح)
            </div>,
        count: "10 مرات",
    },
    {
        name: <div> 
                اللّهُـمَّ إِنِّـي أَسْأَلُـكَ عِلْمـاً نافِعـاً وَرِزْقـاً طَيِّـباً ، وَعَمَـلاً مُتَقَـبَّلاً<br />(بَعْد السّلامِ من صَلاةِ الفَجْر)
            </div>,
        count: "مرة واحدة",
    },
    {
        name: <div> 
                اللَّهُمَّ أَجِرْنِي مِنْ النَّار<br />(بعد صلاة الصبح والمغرب)
            </div>,
        count: "7 مرات",
    },
    {
        name: <div> 
                اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ
            </div>,
        count: "مرة واحدة",
    },
]